Catalogs/Заметки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Заметки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСодержания</Name>
					<Comment>Реквизит для полнотекстового поиска</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляРабочегоСтола</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаЗаметок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПредмета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Заметки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов

// Возвращает список реквизитов, которые не нужно редактировать
// с помощью обработки группового изменения объектов
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ДляРабочегоСтола");
	Результат.Добавить("Предмет");
	Результат.Добавить("Пометка");
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры

Функция ОтправитьЗаметкуНаСайт(ЗаметкаСсылка) Экспорт
	
	Если ТипЗнч(ЗаметкаСсылка.Предмет) = Тип("ДокументСсылка.Спецификация") Тогда
		
		СпецификацияСсылка = ЗаметкаСсылка.Предмет; 
		
		ТекДата = ТекущаяДата();
		НомерСпец = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(СпецификацияСсылка.Номер);	
		ТекстЗаметки = ЗаметкаСсылка.ТекстСодержания;
		
		Стр = "<?xml version=""1.0""?>
		|<notes>
	    |<order_number>" + НомерСпец + "</order_number>
	    |<date>" + ТекДата + "</date>
	    |<text>" + ТекстЗаметки + "</text>
		|</notes>";

		Соединение = Новый HTTPСоединение("rospil.me",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	 
	  	запросPOST = Новый HTTPЗапрос("/api/order-note"); 
		запросPOST.Заголовки.Вставить("Accept", "application/atom+xml");
	    запросPOST.Заголовки.Вставить("Content-type", "text/plain; charset=" + "UTF-8");

	    запросPOST.УстановитьТелоИзСтроки(Стр,"UTF-8",ИспользованиеByteOrderMark.НеИспользовать);
	 
	    Соединение.ОтправитьДляОбработки(запросPOST, "c:\111\request.txt");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
